In [1]:
import pandas as pd

In [4]:
s= pd.Series([45,22,33,66,77])

In [5]:
s

0    45
1    22
2    33
3    66
4    77
dtype: int64

In [6]:
import numpy as np

In [7]:
s= pd.Series([45,22,33,66,77],dtype = np.int8)

In [8]:
s

0    45
1    22
2    33
3    66
4    77
dtype: int8

In [9]:
s[4]

77

In [10]:
type(s)

pandas.core.series.Series

In [12]:
s.dtype  #what type of data contain

dtype('int8')

In [13]:
s.shape

(5,)

In [14]:
s.values  #conveted into arrays

array([45, 22, 33, 66, 77], dtype=int8)

##### DataFrame

In [19]:
#Create three Series
r= pd.Series([1,2,3,4,5])
n= pd.Series(["priya","mira","rahul","sahil","diksha"])
m=pd.Series([78.45,66.2,88.33,66,77])

In [20]:
df = pd.DataFrame({"RollNo":r,
                  "Names":n,
                  "Marks":m})

In [21]:
df

   RollNo   Names  Marks
0       1   priya  78.45
1       2    mira  66.20
2       3   rahul  88.33
3       4   sahil  66.00
4       5  diksha  77.00

In [23]:
#type of df

df.dtypes

RollNo      int64
Names      object
Marks     float64
dtype: object

In [25]:
#no of elements

df.size

15

In [26]:
#no of colums and rows
df.shape

(5, 3)

In [27]:
# https:mitu.co.in/dataset

##### Loat The Data

In [34]:
df= pd.read_csv("datasets/student1 (2).csv")

In [35]:
df

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [37]:
df= pd.read_csv("datasets/student1 (2).csv",names = ["A","B","C","D","E"])

In [38]:
df

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [39]:
None

In [40]:
df= pd.read_csv("datasets/student1 (2).csv",names = None)

In [41]:
df

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [42]:
df= pd.read_csv("datasets/student1 (2).csv",header = None)

In [43]:
df

    0        1   2      3   4
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [45]:
df3= pd.read_csv("datasets/student3.tsv")

In [46]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [48]:
#chage the seperator

df3= pd.read_csv("datasets/student3.tsv",sep="\t")

In [49]:
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [52]:
#Directly Load the file(iries)

df3= pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv")

In [53]:
df3

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [59]:
df.shape #Attributes

(10, 1)

In [60]:
df.size   #Attributes

10

In [61]:
df.dtypes   #Attributes

roll\tname\tclass\tmarks\tage    object
dtype: object

In [62]:
df.columns  #Attributes

Index(['roll\tname\tclass\tmarks\tage'], dtype='object')

In [63]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [64]:
df.values

array([['1\tanil\tTE\t56.77\t22'],
       ['2\tamit\tTE\t59.77\t21'],
       ['3\taniket\tBE\t76.88\t19'],
       ['4\tajinkya\tTE\t69.66\t20'],
       ['5\tasha\tTE\t63.28\t20'],
       ['6\tayesha\tBE\t49.55\t20'],
       ['7\tamar\tBE\t65.34\t19'],
       ['8\tamita\tBE\t68.33\t23'],
       ['9\tamol\tTE\t56.75\t20'],
       ['10\tanmol\tBE\t78.66\t21']], dtype=object)

In [65]:
df.T  #(colums become rows and viceversa)

,0,1,2,3,4,5,6,7,8,9
roll\tname\tclass\tmarks\tage,1\tanil\tTE\t56.77\t22,2\tamit\tTE\t59.77\t21,3\taniket\tBE\t76.88\t19,4\tajinkya\tTE\t69.66\t20,5\tasha\tTE\t63.28\t20,6\tayesha\tBE\t49.55\t20,7\tamar\tBE\t65.34\t19,8\tamita\tBE\t68.33\t23,9\tamol\tTE\t56.75\t20,10\tanmol\tBE\t78.66\t21

In [66]:
df.head()

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20

In [69]:
df.head(3)   #1st three rows

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19

In [70]:
df.tail(5)  #last 5 rows shown

  roll\tname\tclass\tmarks\tage
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

##### Index Based Sclicing

In [71]:
 x = df.iloc[2:8,1:4]  # (r,C)

In [72]:
x

Empty DataFrame
Columns: []
Index: [2, 3, 4, 5, 6, 7]

In [73]:
df= pd.read_csv("datasets/student1 (2).csv")

In [74]:
df

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [75]:
 x = df.iloc[2:8,1:4]  # (r,C)

In [76]:
x

      anil  TE  56.77
2  ajinkya  TE  69.66
3     asha  TE  63.28
4   ayesha  BE  49.55
5     amar  BE  65.34
6    amita  BE  68.33
7     amol  TE  56.75

In [77]:
df.iloc[:8,1:4]

      anil  TE  56.77
0     amit  TE  59.77
1   aniket  BE  76.88
2  ajinkya  TE  69.66
3     asha  TE  63.28
4   ayesha  BE  49.55
5     amar  BE  65.34
6    amita  BE  68.33
7     amol  TE  56.75

In [78]:
df.iloc[2:,1:4]

      anil  TE  56.77
2  ajinkya  TE  69.66
3     asha  TE  63.28
4   ayesha  BE  49.55
5     amar  BE  65.34
6    amita  BE  68.33
7     amol  TE  56.75
8    anmol  BE  78.66

In [79]:
df.iloc[2:,1:]

      anil  TE  56.77  22
2  ajinkya  TE  69.66  20
3     asha  TE  63.28  20
4   ayesha  BE  49.55  20
5     amar  BE  65.34  19
6    amita  BE  68.33  23
7     amol  TE  56.75  20
8    anmol  BE  78.66  21

In [81]:
df.iloc[:8,:4]     #(nothing is there it take all the row and all the column)

   1     anil  TE  56.77
0  2     amit  TE  59.77
1  3   aniket  BE  76.88
2  4  ajinkya  TE  69.66
3  5     asha  TE  63.28
4  6   ayesha  BE  49.55
5  7     amar  BE  65.34
6  8    amita  BE  68.33
7  9     amol  TE  56.75

In [84]:
df.iloc[[3,7,5,8],:]   #random row

    1   anil  TE  56.77  22
3   5   asha  TE  63.28  20
7   9   amol  TE  56.75  20
5   7   amar  BE  65.34  19
8  10  anmol  BE  78.66  21

In [85]:
df.iloc[[3,7,5,8],[1,3]]   #random row random columns

    anil  56.77
3   asha  63.28
7   amol  56.75
5   amar  65.34
8  anmol  78.66

In [87]:
df.iloc[4,:]    #4 no row and all column

1             6
anil     ayesha
TE           BE
56.77     49.55
22           20
Name: 4, dtype: object

In [90]:
df.iloc[: ,1]  # all row and 1 column  [1 row 1 column is the series]

0       amit
1     aniket
2    ajinkya
3       asha
4     ayesha
5       amar
6      amita
7       amol
8      anmol
Name: anil, dtype: object

In [92]:
df.iloc[3 ,1]   #row 3 and column 1 value

'asha'

##### Label Based Slicing

In [97]:
df3= pd.read_csv("datasets/student3.tsv",sep="\t")

In [98]:
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [100]:
df3.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [102]:
df3.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [105]:
df3["name"]   #without using loc Attribute

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [106]:
df3[["name","marks"]]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [107]:
df3.name  #if only for one column retries

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [109]:
df3.name.values    #converted into arrays

array(['anil', 'amit', 'aniket', 'ajinkya', 'asha', 'ayesha', 'amar',
       'amita', 'amol', 'anmol'], dtype=object)

In [110]:
df3.drop(5)               #we dont want row  no 5 then

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [112]:
df3.drop([5,7])   #for multiple rows list is passed.

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [113]:
df3.drop("class",axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [114]:
df3.drop(["class","age"],axis = 1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [122]:
df3.shape

(10, 3)

In [124]:
df3.shape

(10, 3)

In [125]:
df3["marks"].median()

64.31

In [126]:
df3["marks"].mean()

64.499

In [127]:
df3["marks"].sum()

644.9899999999999

In [128]:
df3["marks"].std()     #standard deviation =avg distance of every pts from mean.

9.207178901994535

In [129]:
df3.count()

roll     10
name     10
marks    10
dtype: int64

In [130]:
df3= pd.read_csv("datasets/student3.tsv",sep="\t")

In [133]:
df3.count()           #returns non null values are shown

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [134]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [135]:
df3.describe()    #complete numeric of the data

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [136]:
df3.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [138]:
df3.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [139]:
df3["marks"].max()

78.66

In [142]:
df3.std(numeric_only=True)

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [143]:
df3.sum(axis = 1,numeric_only=True)    #addition of row data.

0     79.77
1     82.77
2     98.88
3     93.66
4     88.28
5     75.55
6     91.34
7     99.33
8     85.75
9    109.66
dtype: float64

In [144]:
df3["class"].value_counts()        #total no of data

class
TE    5
BE    5
Name: count, dtype: int64

In [145]:
df3["marks"].value_counts()

marks
56.77    1
59.77    1
76.88    1
69.66    1
63.28    1
49.55    1
65.34    1
68.33    1
56.75    1
78.66    1
Name: count, dtype: int64

In [146]:
df3["age"].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [147]:
df3.sort_values("class")

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [148]:
df3.sort_values("age")

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
6     7     amar    BE  65.34   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
8     9     amol    TE  56.75   20
1     2     amit    TE  59.77   21
9    10    anmol    BE  78.66   21
0     1     anil    TE  56.77   22
7     8    amita    BE  68.33   23

In [149]:
df3.sort_values("age",ascending = True)

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
6     7     amar    BE  65.34   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
8     9     amol    TE  56.75   20
1     2     amit    TE  59.77   21
9    10    anmol    BE  78.66   21
0     1     anil    TE  56.77   22
7     8    amita    BE  68.33   23

In [154]:
df3.sort_values("age",decending = True)

TypeError: DataFrame.sort_values() got an unexpected keyword argument 'decending'

In [151]:
df3.sort_values(["age","marks"])

   roll     name class  marks  age
6     7     amar    BE  65.34   19
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
8     9     amol    TE  56.75   20
4     5     asha    TE  63.28   20
3     4  ajinkya    TE  69.66   20
1     2     amit    TE  59.77   21
9    10    anmol    BE  78.66   21
0     1     anil    TE  56.77   22
7     8    amita    BE  68.33   23

In [153]:
df3.sort_values(["class","marks"])   #first sorted by class and then by marks

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
2     3   aniket    BE  76.88   19
9    10    anmol    BE  78.66   21
8     9     amol    TE  56.75   20
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
4     5     asha    TE  63.28   20
3     4  ajinkya    TE  69.66   20

##### Custom Column operation

In [156]:
df3["marks"] + 0.5    #Added 0.5 in every marks

0    57.27
1    60.27
2    77.38
3    70.16
4    63.78
5    50.05
6    65.84
7    68.83
8    57.25
9    79.16
Name: marks, dtype: float64

In [159]:
df3["marks"] = df3["marks"] + 0.5    #replaces the marks.

In [160]:
df

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [161]:
#if column is not present it creates

In [163]:
df3["cgpa"] = df3["marks"] /10+0.34

In [164]:
df3

   roll     name class  marks  age   cgpa
0     1     anil    TE  57.77   22  6.117
1     2     amit    TE  60.77   21  6.417
2     3   aniket    BE  77.88   19  8.128
3     4  ajinkya    TE  70.66   20  7.406
4     5     asha    TE  64.28   20  6.768
5     6   ayesha    BE  50.55   20  5.395
6     7     amar    BE  66.34   19  6.974
7     8    amita    BE  69.33   23  7.273
8     9     amol    TE  57.75   20  6.115
9    10    anmol    BE  79.66   21  8.306

In [165]:
df3["First_class"] = df3["marks"] > 60
df3

   roll     name class  marks  age   cgpa  First_class
0     1     anil    TE  57.77   22  6.117        False
1     2     amit    TE  60.77   21  6.417         True
2     3   aniket    BE  77.88   19  8.128         True
3     4  ajinkya    TE  70.66   20  7.406         True
4     5     asha    TE  64.28   20  6.768         True
5     6   ayesha    BE  50.55   20  5.395        False
6     7     amar    BE  66.34   19  6.974         True
7     8    amita    BE  69.33   23  7.273         True
8     9     amol    TE  57.75   20  6.115        False
9    10    anmol    BE  79.66   21  8.306         True

In [166]:
#manually add a column

x = ["M","M","M","F","F","F","F","M","M","F"]

df3["Gender"] = x
df3

   roll     name class  marks  age   cgpa  First_class Gender
0     1     anil    TE  57.77   22  6.117        False      M
1     2     amit    TE  60.77   21  6.417         True      M
2     3   aniket    BE  77.88   19  8.128         True      M
3     4  ajinkya    TE  70.66   20  7.406         True      F
4     5     asha    TE  64.28   20  6.768         True      F
5     6   ayesha    BE  50.55   20  5.395        False      F
6     7     amar    BE  66.34   19  6.974         True      F
7     8    amita    BE  69.33   23  7.273         True      M
8     9     amol    TE  57.75   20  6.115        False      M
9    10    anmol    BE  79.66   21  8.306         True      F

In [177]:
#create a new frame having 1 column common as roll no for Joinig Two frames.

ndf = pd.DataFrame({ "roll":range(1,11),
                    "cgpa":df3["marks"] /10+0.34  ,
                    "Gender": ["M","M","M","F","F","F","F","M","M","F"]
    
})

ndf

   roll   cgpa Gender
0     1  6.017      M
1     2  6.317      M
2     3  8.028      M
3     4  7.306      F
4     5  6.668      F
5     6  5.295      F
6     7  6.874      F
7     8  7.173      M
8     9  6.015      M
9    10  8.206      F

In [190]:
df3= pd.read_csv("datasets/student (3).csv")

In [194]:
df3.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [195]:
ndf.columns

Index(['roll', 'cgpa', 'Gender'], dtype='object')

In [199]:
df3.merge(ndf, on ="roll")

   roll     name class  marks  age   cgpa Gender
0     1     anil    TE  56.77   22  6.017      M
1     2     amit    TE  59.77   21  6.317      M
2     3   aniket    BE  76.88   19  8.028      M
3     4  ajinkya    TE  69.66   20  7.306      F
4     5     asha    TE  63.28   20  6.668      F
5     6   ayesha    BE  49.55   20  5.295      F
6     7     amar    BE  65.34   19  6.874      F
7     8    amita    BE  68.33   23  7.173      M
8     9     amol    TE  56.75   20  6.015      M
9    10    anmol    BE  78.66   21  8.206      F

In [197]:
df5= pd.read_csv("datasets/student5 (1).csv")

In [202]:
pd.concat([df3,df5])        #concatinate two frames(files)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [203]:
pd.concat([df3,df5],ignore_index = True)    #concatinate two frames with continuation index

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

##### String Operation

In [204]:
name = "Diksha"

In [206]:
name.upper()

'DIKSHA'

In [207]:
name.replace("I","EE")

'Diksha'

In [208]:
name.replace("i","ee")

'Deeksha'

In [210]:
df3["name"].str.upper()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [211]:
df3["name"].str.title()

0       Anil
1       Amit
2     Aniket
3    Ajinkya
4       Asha
5     Ayesha
6       Amar
7      Amita
8       Amol
9      Anmol
Name: name, dtype: object

In [212]:
df3["name"].str.endswith("a")

0    False
1    False
2    False
3     True
4     True
5     True
6    False
7     True
8    False
9    False
Name: name, dtype: bool

In [213]:
df3["name"].str.startswith("am")

0    False
1     True
2    False
3    False
4    False
5    False
6     True
7     True
8     True
9    False
Name: name, dtype: bool

In [214]:
df3["name"].str.replace("i","ee")

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

In [215]:
df3["name"].str.count("a")

0    1
1    1
2    1
3    2
4    2
5    2
6    2
7    2
8    1
9    1
Name: name, dtype: int64

In [216]:
df3["name"].str.find("y")

0   -1
1   -1
2   -1
3    5
4   -1
5    1
6   -1
7   -1
8   -1
9   -1
Name: name, dtype: int64

In [217]:
df3["name"].str.isalpha()

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: name, dtype: bool

##### Grouping And Aggregation

In [219]:
gr = df3.groupby("class")

In [220]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [221]:
gr.get_group("TE")

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [222]:
gr.min()

       roll     name  marks  age
class
BE        3     amar  49.55   19
TE        1  ajinkya  56.75   20

In [223]:
gr.max()

       roll    name  marks  age
class
BE       10  ayesha  78.66   23
TE        9    asha  69.66   22

In [224]:
gr["marks"].max()

class
BE    78.66
TE    69.66
Name: marks, dtype: float64

##### Boolean Filtering

In [226]:
df3["marks"] > 60

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [231]:
mask=df3["marks"] > 60    #created a mask
df3[mask]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [232]:
df3[df3["marks"] > 60]    # Without mask

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [230]:
df3[df3["name"].str.startswith("an")]

   roll    name class  marks  age
0     1    anil    TE  56.77   22
2     3  aniket    BE  76.88   19
9    10   anmol    BE  78.66   21

In [235]:
x=df3[(df3["marks"] > 60) &( df3["class"] =="BE")] 
x

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

##### Export The Data

In [237]:
x.to_csv("datasets/output.csv" , index = False)

In [238]:
x.to_html("datasets/output.html" , index = False)